app/controllers/instruments_controller.rb

  def index
    @instruments = Instrument.all
---
SELECT * FROM `instruments` ORDER BY name ASC

  def show
    @instrument = Instrument.find(params[:id])
---
SELECT * FROM `instruments` WHERE (`instruments`.`id` = 7) ORDER BY name ASC

  def edit
    @instrument = Instrument.find(params[:id])
---
SELECT * FROM `instruments` WHERE (`instruments`.`id` = 7) ORDER BY name ASC

  def update
    @instrument = Instrument.find(params[:id])

    respond_to do |format|
      if @instrument.update_attributes(params[:instrument])
---
SELECT * FROM `instruments` WHERE (`instruments`.`id` = 7) ORDER BY name ASC
UPDATE `instruments` SET `updated_at` = '2010-08-03 20:34:56', `name` = 'Arranger/Orchestrater' WHERE `id` = 7