app/controllers/locals_controller.rb

  def index
    @locals = Local.paginate :page => params[:page]
---
SELECT * FROM `locals` ORDER BY created_at DESC, sort_num ASC LIMIT 0, 20
SELECT count(*) AS count_all FROM `locals`

  def show
    @local = Local.find(params[:id])
---
SELECT * FROM `locals` WHERE (`locals`.`id` = 1) ORDER BY sort_num ASC

  def edit
    @local = Local.find(params[:id])
---
SELECT * FROM `locals` WHERE (`locals`.`id` = 1) ORDER BY sort_num ASC

  def update
    @local = Local.find(params[:id])

    respond_to do |format|
      if @local.update_attributes(params[:local])
---
SELECT * FROM `locals` WHERE (`locals`.`id` = 1) ORDER BY sort_num ASC
UPDATE `locals` SET `address` = '2103 59th St.', `fax_number` = '3166363596', `city` = 'St. Louis', `city_state_title` = 'St. Louis, MO', `chartered` = '1896-11-19', `phone_primary` = '3166363595', `state_province_id` = 24, `updated_at` = '2010-08-04 16:26:34', `jurisdiction` = 'All of the following counties: Audrain, Bollinger, Boone, Butler, Callaway, Camden, Cape Girardeau, Carter, Chariton, Cole, Cooper, Crawford, Dunklin, Franklin, Gasconade, Howard, Iron, Jefferson, Lincoln County (except Portage des Sioux), Linn, Macon, Madison, Maries, Miller, Mississippi, Moniteau, Montgomery, Morgan, New Madrid, Osage, Pemiscot, Perry, Phelps, Pulaski, Randolph, Reynolds, Ripley, Scott, St. Charles, St. Francis, St. Louis City, St. Louis County, Ste. Genevieve, Stoddard, Warren, Washington and Wayne.', `postal_code` = '46204', `url` = 'http://stlouismusicpros.com', `country_id` = 1 WHERE `id` = 57