app/controllers/locals_controller.rb

SELECT * FROM `locals` WHERE (`locals`.`number` = '1') ORDER BY sort_num ASC LIMIT 1
---
  def edit
    @local = Local.find_by_number(params[:id])

SELECT * FROM `locals` WHERE (`locals`.`number` = '5') ORDER BY sort_num ASC LIMIT 1
---
  def update
    @local = Local.find_by_number(params[:id])