app/controllers/musicians_controller.rb

  def index
    @musicians = Musician.search params[:search] #paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM "musicians" ORDER BY created_at DESC LIMIT 20 OFFSET 0

  def show
    @musician = Musician.find(params[:id])
---
SELECT * FROM `musicians` WHERE (`musicians`.`id` = 1)

  def edit
    @musician = Musician.find(params[:id])
---
SELECT * FROM `musicians` WHERE (`musicians`.`id` = 1)

  def create
    @musician = Musician.new(params[:musician])

    respond_to do |format|
      if @musician.save
---
INSERT INTO `musicians` (`city`, `state_province`, `postal_code`, `updated_at`, `birthdate`, `ssn`, `country_id`, `primary_phone_choice`, `firstname`, `lastname`, `phone_home`, `mi`, `phone_work`, `stage_lastname`, `phone_cell`, `stage_firstname`, `address`, `email`, `created_at`, `suffix`) VALUES('New York', '33', '10032', '2010-07-28 22:49:46', '1979-07-02', NULL, 1, 0, 'Matthew', 'Plummer', '', 'T', '917-229-0238', '', '617 407-2957', '', '560 w 163rd St. #45', 'plummerspace@gmail.com', '2010-07-28 22:49:46', '')

  def update
    @musician = Musician.find(params[:id])

    respond_to do |format|
      if @musician.update_attributes(params[:musician])
---
SELECT * FROM `musicians` WHERE (`musicians`.`id` = 1)
UPDATE `musicians` SET `phone_cell` = '6174072957', `state_province` = '1', `phone_work` = '9172290238', `updated_at` = '2010-07-28 22:53:13' WHERE `id` = 1

  def destroy
    @musician = Musician.find(params[:id])
    @musician.destroy
---
SELECT * FROM `musicians` WHERE (`musicians`.`id` = 1)
DELETE FROM `musicians` WHERE `id` = 1