app/controllers/state_provinces_controller.rb

SELECT * FROM `state_provinces`
---
  def index
    @state_provinces = StateProvince.all